# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:

  - [8,5, 11,7, 13,9]  # P2/4
  - [21,10, 30,12, 25,18]  # P3/8
  - [43,17, 45,31, 66,25]  # P4/16
  - [85,44, 56,75, 130,77] # P5/32

#  - [8,6, 11,7, 17,9]  # P3/8
#  - [24,12, 38,15, 34,25]  # P4/16
#  - [63,25, 64,47, 130,58]  # P5/32

#  - [6,8, 8,12, 10,9]  # P3/8
#  - [12,16, 14,12, 18,18]  # P4/16
#  - [28,23, 43,37, 71,76]  # P5/32

#  - [6,8, 7.5,13, 10.5,10]  # P3/8
#  - [14.5,12, 11,16, 16,16]  # P4/16
#  - [24,17, 19,24, 34,25]  # P5/32
#  - [30.5,38, 50.5,43.5, 77,84]  # P5/32
# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ACBlock, [64, 3, 2]],
   [-1, 1, ACBlock, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3_att, [128,3,1]],
    [-1, 1, CoordAtt , [128]],#11# 2
   [-1, 1, ACBlock, [256, 3, 2]],  # 3-P3/8   ACBlock
   [-1, 6, C3_att, [256,3,1]],
    [-1, 1, CoordAtt , [256]],#11# 5
   [-1, 1, ACBlock, [512, 3, 2]],  # 5-P4/16
   [-1, 9,C3_att, [512,3,1]],
    [-1, 1, CoordAtt , [512]],#11# 8
   [-1, 1, ACBlock, [1024, 3,2]],  # 7-P5/32
   [-1, 3, C3_att, [1024,3,1]],
    [-1, 1, CoordAtt , [1024]],#11
    [-1, 1, SPPF, [1024, 5]], # 9   11
    ]


# YOLOv5 head
head:
  [[-1, 1, VoVCSP, [512,1,1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 3,C3, [512, False]],  # 13          17

   [-1, 1, VoVCSP, [256, 1,1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)   21   19

   [-1, 1, VoVCSP, [128, 1,1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2
   [-1, 6, C3, [128, False]],  # 21 (P2/4-xsmall)    25   23


   [-1, 1, Conv, [128, 3, 2]],        # 24
   [[-1, 22], 1, Concat, [1]],  # cat head P3
   [-1, 6, C3, [256, False]],  # 24 (P3/8-small)     28

#
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat head P4
   [-1, 6, C3, [512, False]],  # 27 (P4/16-medium)    31


   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P5
   [-1, 6, C3, [1024, False]],  # 30 (P5/32-large)

   [[25 ,28,31,34], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]







#  - [8,5, 11,7, 13,9]  # P2/4
#  - [21,10, 30,12, 25,18]  # P3/8
#  - [43,17, 45,31, 66,25]  # P4/16
#  - [85,44, 56,75, 130,77] # P5/32


#  - [8,6, 11,7, 17,9]  # P3/8
#  - [24,12, 38,15, 34,25]  # P4/16
#  - [63,25, 64,47, 130,58]  # P5/32


#  [[-1, 1, GhostConv_, [64, 3, 1]],
#   [-1, 1, GhostConv_, [128, 3, 2]],  # 1-P2/4
#   [-1, , GhostConv_, [128]],
#    [-1, 1, CoordAtt , [128]],#11# 2
#   [-1, 1, GhostConv_, [256, 3, 2]],  # 3-P3/8   ACBlock
#   [-1, 6, C3_att, [256]],
#    [-1, 1, CoordAtt , [256]],#11# 5
#   [-1, 1, GhostConv_, [512, 3, 2]],  # 5-P4/16
#   [-1, 9,C3_att, [512]],
#    [-1, 1, CoordAtt , [512]],#11# 8
#   [-1, 1, GhostConv_, [1024, 3, 2]],  # 7-P5/32
#   [-1, 3, C3_att, [1024]],
#    [-1, 1, CoordAtt , [1024]],#11
#    [-1, 1, SPPF, [1024, 5]], # 9   11
#    ]
## YOLOv5 head
#head:
#  [[-1, 1, Conv, [512, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
#   [-1, 3, C3, [512, False]],  # 13          17
##   [-1, 1, CBAM, [512]],
#
#   [-1, 1, Conv, [256, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
#   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)   21   19
##   [-1, 1, CBAM , [256]],
#
#   [-1, 1, Conv, [128, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 2], 1, Concat, [1]],  # cat backbone P2
#   [-1, 1, C3, [128, False]],  # 21 (P2/4-xsmall)    25   23
##   [-1, 1, CBAM , [128]],
#
#   [-1, 1, GhostConv_, [128, 3, 2]],        # 24
#   [[-1, 22], 1, Concat, [1]],  # cat head P3
#   [-1, 3, C3, [256, False]],  # 24 (P3/8-small)     28
##   [-1, 1, CBAM , [256]],
#
#   [-1, 1, GhostConv_, [256, 3, 2]],
#   [[-1, 18], 1, Concat, [1]],  # cat head P4
#   [-1, 3, C3, [512, False]],  # 27 (P4/16-medium)    31
##      [-1, 1, GAM_Attention , [512]],
#
#   [-1, 1, GhostConv_, [512, 3, 2]],
#   [[-1, 14], 1, Concat, [1]],  # cat head P5
#   [-1, 3, C3, [1024, False]],  # 30 (P5/32-large)
#
#   [[25 ,28,31,34], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
#  ]