# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:

  - [8,5, 11,7, 13,9]  # P2/4
  - [21,10, 30,12, 25,18]  # P3/8
  - [43,17, 45,31, 66,25]  # P4/16
  - [85,44, 56,75, 130,77] # P5/32

#  - [ 8,6,  12,7,  13,10,  19,9 ]  # P3/8
#  - [ 27,11,  24,16,  38,16,  41,27 ]  # P5/32
#  - [ 62,24,  86,39,  62,62,  151,76 ]  # P5/32

#  - [6,8, 8,12, 10,9]  # P3/8
#  - [12,16, 14,12, 18,18]  # P4/16
#  - [28,23, 43,37, 71,76]  # P5/32

#  - [6,8, 7.5,13, 10.5,10]  # P3/8
#  - [14.5,12, 11,16, 16,16]  # P4/16
#  - [24,17, 19,24, 34,25]  # P5/32
#  - [30.5,38, 50.5,43.5, 77,84]  # P5/32
# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ACBlock, [64, 3, 2]],  # 0-P1/2
   [-1, 1, ACBlock, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3CA, [128]],                        # 2
   [-1, 1, ACBlock, [256, 3, 2]],  # 3-P3/8   ACBlock
   [-1, 6, C3CA, [256]],                          # 5
   [-1, 1, ACBlock, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3CA, [512]],                           # 8
   [-1, 1, ACBlock, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3CA, [1024]],                          #11
   [-1, 1, SPPF, [1024, 5]],  # 9
    ]
# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13          17

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3,C3, [256, False]],  # 17 (P3/8-small)   21

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2
   [-1, 1,C3, [128, False]],  # 21 (P2/4-xsmall)    25   19

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 18,4], 1, Concat, [1]],  # cat head P3
   [-1, 3, C3, [256, False]],  # 24 (P3/8-small)     28    22

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14,6], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 27 (P4/16-medium)    31    25

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 9], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 30 (P5/32-large)       28

   [[19,22 ,25,28], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]

#  - [8,5, 11,7, 13,9]  # P2/4
#  - [21,10, 30,12, 25,18]  # P3/8
#  - [43,17, 45,31, 66,25]  # P4/16
#  - [85,44, 56,75, 130,77] # P5/32


#  - [8,6, 11,7, 17,9]  # P3/8
#  - [24,12, 38,15, 34,25]  # P4/16
#  - [63,25, 64,47, 130,58]  # P5/32