# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [8,6, 11,7, 17,9]  # P3/8
  - [24,12, 38,15, 34,25]  # P4/16
  - [63,25, 64,47, 130,58]  # P5/32


# yolov4-csp backbone
backbone:
# [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, C3, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 2, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 8, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 8, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]], # 9-P5/32
   [-1, 4, C3, [1024]],  # 10
  ]

# yolov4-csp head
# na = len(anchors[0])
head:
  [[-1, 1, SPPCSP, [512]], # 11
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [8, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   [-1, 2, C3, [256]], # 16
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [128, 1, 1]], # route backbone P3

   [[-1, -2], 1, Concat, [1]],
   [-1, 2, C3, [128]], # 21
   [-1, 1, Conv, [256, 3, 1]],

   [-2, 1, Conv, [256, 3, 2]],
   [[-1, 16], 1, Concat, [1]],  # cat
   [-1, 2, C3, [256]], # 25
   [-1, 1, Conv, [512, 3, 1]],

   [-2, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat
   [-1, 2, C3, [512]], # 29
   [-1, 1, Conv, [1024, 3, 1]],




   [[22,26,30], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]

#  - [8,5, 11,7, 13,9]  # P3/8
#  - [21,10, 30,12, 25,18]  # P4/16
#  - [43,17, 45,31, 66,25]  # P5/32
#  - [85,44, 56,75, 130,77]