# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:

  - [8,6, 12,7, 18,9]  # P3/8
  - [23,12, 35,14, 36,21]  # P4/16
  - [64,24, 56,42, 104,53]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, ACBlock, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, ACBlock, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, ACBlock, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, ACBlock, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
   [-1, 1, SE, [512]],
  ]

# YOLOv5 v6.0 BiFPN head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15, 6], 1, Concat, [1]],  # cat P4 <--- BiFPN change
   [-1, 3,C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[18, 21, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

#  - [8,5, 12,8, 21,10]  # P3/8
#  - [35,14, 50,25, 79,49]  # P4/16


#  - [8,5, 12,8]  # P3/8
#  - [21,10， 35,14]  # P4/16
#  - [50,25, 79,49]  # P5/32

#  - [8,6, 12,7, 18,9]  # P3/8
#  - [23,12, 35,14, 36,21]  # P4/16
#  - [64,24, 56,42, 104,53]  # P5/32

#  - [8,5, 11,7, 13,9]  # P3/8
#  - [21,10, 30,12, 25,18]  # P4/16
#  - [43,17, 45,31, 66,25]  # P5/32
#  - [85,44, 56,75, 130,77]