# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [8,6, 12,7, 18,9]  # P3/8
  - [23,12, 35,14, 36,21]  # P4/16
  - [64,24, 56,42, 104,53]  # P5/32

# YOLOv5 backbone
backbone:
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, ACBlock, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3_attention, [128]],
   [-1, 1, ACBlock, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3_attention, [256]],
   [-1, 1, ACBlock, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3_attention, [512]],
   [-1, 1, ACBlock, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3_attention, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10 1280, 640
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11 40 上采样
   [[-1, 6], 1, Concat, [1]],  # 12 cat backbone P4  # cat 40,40
   [-1, 3, C3_attention, [512, False]],  # 13  # 640, 640

   [-1, 1, Conv, [256, 1, 1]], # 640, 320
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 80  640, 320 上采样
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3  # cat 80,80
   [-1, 4,C3_attention, [256, False]],  # 17 (P3/8-small) # 320, 320

#   [-1, 1, Conv, [256, 1, 1]],   # 320, 320
   [-1, 1, Conv, [512, 3, 2]],   # 320, 640 # 下 40
   [[-1, 6, 13], 1, Concat, [1]],  # cat head P4  # cat 40,40
   [-1, 3, C3_attention, [512, False]],  # 21 (P4/16-medium)  # 640, 640  #20

#   [-1, 1, Conv, [512, 1, 1]], # 640, 640
   [-1, 1, Conv, [1024, 3, 2]], # 640, 1280 # 下 20  #21
   [[-1, 9], 1, Concat, [1]],  # cat head P5  cat 20,20 #22
   [-1, 3, C3, [1024, False]],  # 25 (P5/32-large) # 1280, 1280  #23

#   [[17, 21, 25], 1, Detect, [nc, anchors]] # Detect(P3, P4, P5)
   [[17, 20, 23], 1, Detect, [nc, anchors]] # Detect(P3, P4, P5)
   ]